app/views/restaurants/show.html.haml

SELECT  1 AS one FROM "reviews" WHERE "reviews"."restaurant_id" = $1 LIMIT 1  [["restaurant_id", 38]]
---

- if @restaurant.reviews.any?